{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "filters": 32, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "filters": 64, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activation": "relu", "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "valid", "bias_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "dtype": "float32", "seed": null, "name": "dropout", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "activation": "relu", "kernel_constraint": null, "name": "dense", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 512, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "activation": "softmax", "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 10, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "epsilon": 1e-07, "amsgrad": false, "beta_2": 0.9990000128746033, "decay": 0.0, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "weighted_metrics": null, "metrics": ["acc"]}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}